In [1]:
import pandas as pd

In [2]:
obj=pd.Series([32,34,34,30,25,32,0],index=["mon","tue","wed","thu","fri","sat","sun"],name="one week attendence")

In [3]:
obj

mon    32
tue    34
wed    34
thu    30
fri    25
sat    32
sun     0
Name: one week attendence, dtype: int64

In [4]:
obj["mon"]

32

In [5]:
obj.values

array([32, 34, 34, 30, 25, 32,  0], dtype=int64)

In [6]:
obj.index

Index(['mon', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun'], dtype='object')

In [7]:
obj[4]

25

In [8]:
obj[["tue","wed"]]

tue    34
wed    34
Name: one week attendence, dtype: int64

In [9]:
obj[obj>25]

mon    32
tue    34
wed    34
thu    30
sat    32
Name: one week attendence, dtype: int64

In [10]:
"sun" in obj

True

In [11]:
"Mon" in obj

False

In [12]:
import numpy as np
arr=np.arange(3,7)

In [13]:
data=pd.Series(arr)

In [14]:
data

0    3
1    4
2    5
3    6
dtype: int32

In [15]:
obj.head()

mon    32
tue    34
wed    34
thu    30
fri    25
Name: one week attendence, dtype: int64

In [16]:
obj.head(n=3)

mon    32
tue    34
wed    34
Name: one week attendence, dtype: int64

In [17]:
obj.tail()

wed    34
thu    30
fri    25
sat    32
sun     0
Name: one week attendence, dtype: int64

In [18]:
data1={"name":"simra","father":"rafiq","roll":13,"course":"ai"}
l=pd.Series(data1,index=["name","father","roll","course","section"])

In [19]:
l

name       simra
father     rafiq
roll          13
course        ai
section      NaN
dtype: object

In [20]:
l.isnull()

name       False
father     False
roll       False
course     False
section     True
dtype: bool

In [21]:
l.name="data"

In [22]:
l

name       simra
father     rafiq
roll          13
course        ai
section      NaN
Name: data, dtype: object

In [23]:
l["section"]="B"

In [24]:
l

name       simra
father     rafiq
roll          13
course        ai
section        B
Name: data, dtype: object

In [25]:
l.index.name="data key"

In [26]:
l

data key
name       simra
father     rafiq
roll          13
course        ai
section        B
Name: data, dtype: object

In [27]:
l.index

Index(['name', 'father', 'roll', 'course', 'section'], dtype='object', name='data key')

**DATA FRAME**

In [28]:
name=pd.Series(["faraz","sufyan","abeeha","aisha","adeel","simra","husnain"])
data2={"name":name,"roll":[1,2,3,4,5,6,7],"fees":["2000","2500","2000","2300","3000","3500","3500"]}
stud_data=pd.DataFrame(data2,columns=["name","roll","fees","percentage"])
stud_data

      name  roll  fees percentage
0    faraz     1  2000        NaN
1   sufyan     2  2500        NaN
2   abeeha     3  2000        NaN
3    aisha     4  2300        NaN
4    adeel     5  3000        NaN
5    simra     6  3500        NaN
6  husnain     7  3500        NaN

In [29]:
stud_data.index=[1,2,3,4,5,6,7]

In [30]:
stud_data

      name  roll  fees percentage
1    faraz     1  2000        NaN
2   sufyan     2  2500        NaN
3   abeeha     3  2000        NaN
4    aisha     4  2300        NaN
5    adeel     5  3000        NaN
6    simra     6  3500        NaN
7  husnain     7  3500        NaN

In [31]:
stud_data["name"]

1      faraz
2     sufyan
3     abeeha
4      aisha
5      adeel
6      simra
7    husnain
Name: name, dtype: object

In [32]:
stud_data["name"][4]

'aisha'

In [33]:
stud_data.loc[5]

name          adeel
roll              5
fees           3000
percentage      NaN
Name: 5, dtype: object

In [34]:
stud_data["percentage"]=["70%","85%","75%","80%","90%","95%","95%"]
stud_data

      name  roll  fees percentage
1    faraz     1  2000        70%
2   sufyan     2  2500        85%
3   abeeha     3  2000        75%
4    aisha     4  2300        80%
5    adeel     5  3000        90%
6    simra     6  3500        95%
7  husnain     7  3500        95%

In [35]:
stud_data.iloc[3]

name          aisha
roll              4
fees           2300
percentage      80%
Name: 4, dtype: object

In [36]:
stud_data.loc[4]

name          aisha
roll              4
fees           2300
percentage      80%
Name: 4, dtype: object

In [37]:
stud_data.loc[6]["name"]

'simra'

In [38]:
stud_data["fees"][6]

'3500'

In [39]:
stud_data.name

1      faraz
2     sufyan
3     abeeha
4      aisha
5      adeel
6      simra
7    husnain
Name: name, dtype: object

In [40]:
stud_data.name[7]

'husnain'

In [41]:
stud_data.percentage

1    70%
2    85%
3    75%
4    80%
5    90%
6    95%
7    95%
Name: percentage, dtype: object

In [43]:
stud_data

      name  roll  fees percentage
1    faraz     1  2000        70%
2   sufyan     2  2500        85%
3   abeeha     3  2000        75%
4    aisha     4  2300        80%
5    adeel     5  3000        90%
6    simra     6  3500        95%
7  husnain     7  3500        95%

In [44]:
import numpy as np 
import pandas as pd

In [53]:
frame=pd.DataFrame(np.random.randn(4,3),columns=[10,11,12],index=["a","b","c","d"])
print(np.abs(frame))
print(frame[10].min())
print(frame[10].max())
print(frame[10].min()-frame[10].max())

         10        11        12
a  0.997379  0.064374  1.778956
b  0.152049  0.299705  0.249932
c  0.753462  1.019784  0.565520
d  0.185811  1.889281  0.688303
-0.997379456771266
0.15204944928491662
-1.1494289060561826

In [58]:
f=lambda x: x.min()-x.max()
print(frame.apply(f))
print(frame.apply(f,axis=1))

10   -1.149429
11   -2.909065
12   -1.529024
dtype: float64
a   -2.776335
b   -0.549637
c   -1.585304
d   -2.075093
dtype: float64

In [61]:
def max_min(x):
    minimum=x.min()
    maximum=x.min()
    return pd.Series([maximum,minimum],index=["max","min"])

In [62]:
r=frame.apply(max_min)
r

           10        11        12
max -0.997379 -1.019784  0.249932
min -0.997379 -1.019784  0.249932

In [1]:
import numpy as np
import pandas as pd
data=pd.Series(np.array(["blue","red","yellow"]),index=[0,3,5])
print(data)
data=data.reindex(range(6),method="ffill")
print(data)
data1=data.reindex(range(0,11),method="ffill")
data1

0      blue
3       red
5    yellow
dtype: object
0      blue
1      blue
2      blue
3       red
4       red
5    yellow
dtype: object

0       blue
1       blue
2       blue
3        red
4        red
5     yellow
6     yellow
7     yellow
8     yellow
9     yellow
10    yellow
dtype: object

In [9]:
import numpy as np
import pandas as pd
data2=pd.DataFrame(np.arange(9).reshape(3,3),index=["a","b","c"],columns=["karachi","hyderabad","lahore"])
data2

   karachi  hyderabad  lahore
a        0          1       2
b        3          4       5
c        6          7       8

In [25]:
data4=data2.reindex(["a","b","c","d","e"],method="ffill")
print(data4)

   karachi  hyderabad  lahore  qutta
a        0          1       2    NaN
b        3          4       5    NaN
c        6          7       8    NaN
d        6          7       8    NaN
e        6          7       8    NaN

In [27]:
city_name=["karachi","hyderabad","lahore","qutta"]
data3=data2.reindex(columns=city_name,method="ffill")
data3["qutta"]=[4,5,6,7,8]
print(data3)

   karachi  hyderabad  lahore  qutta
a        0          1       2      4
b        3          4       5      5
c        6          7       8      6
d        6          7       8      7
e        6          7       8      8

In [29]:
data3[["karachi","lahore"]]

   karachi  lahore
a        0       2
b        3       5
c        6       8
d        6       8
e        6       8

In [47]:
data3[0:4]

   karachi  hyderabad  lahore  qutta
a        0          1       2      4
b        3          4       5      5
c        6          7       8      6
d        6          7       8      7

In [39]:
data3.karachi[3]

6

In [40]:
data3.karachi[0:4]

a    0
b    3
c    6
d    6
Name: karachi, dtype: int32

In [50]:
data3.lahore[1:4]

b    5
c    8
d    8
Name: lahore, dtype: int32

In [52]:
data3[data3["karachi"]>2]

   karachi  hyderabad  lahore  qutta
b        3          4       5      5
c        6          7       8      6
d        6          7       8      7
e        6          7       8      8

In [53]:
data3.karachi[data3["karachi"]>2]

b    3
c    6
d    6
e    6
Name: karachi, dtype: int32

In [60]:
data4=data3["hyderabad"]>2
data4

a    False
b     True
c     True
d     True
e     True
Name: hyderabad, dtype: bool

In [61]:
data3[data4]

   karachi  hyderabad  lahore  qutta
b        3          4       5      5
c        6          7       8      6
d        6          7       8      7
e        6          7       8      8

In [62]:
data3

   karachi  hyderabad  lahore  qutta
a        0          1       2      4
b        3          4       5      5
c        6          7       8      6
d        6          7       8      7
e        6          7       8      8

In [64]:
data3.iloc[2:]

   karachi  hyderabad  lahore  qutta
c        6          7       8      6
d        6          7       8      7
e        6          7       8      8

In [65]:
data3.iloc[2:,1:3]

   hyderabad  lahore
c          7       8
d          7       8
e          7       8

In [66]:
data3.loc["a"]["lahore"]

2

In [73]:
data3.loc[["a","c"],["lahore","karachi"]]

   lahore  karachi
a       2        0
c       8        6

In [80]:
data3.iloc[2,[0,3,2]]

karachi    6
qutta      6
lahore     8
Name: c, dtype: int64

In [84]:
df1=pd.DataFrame(np.arange(16).reshape(4,4),index=["one","two","three","four"],columns=["punjab","sindh","bilochistan","kpk"])

In [85]:
df1

       punjab  sindh  bilochistan  kpk
one         0      1            2    3
two         4      5            6    7
three       8      9           10   11
four       12     13           14   15

In [89]:
df2=pd.DataFrame(np.arange(16).reshape(4,4),index=["one","two","three","four"],columns=["punjab","sindh","bilochistan","kpk"])

In [90]:
df2

       punjab  sindh  bilochistan  kpk
one         0      1            2    3
two         4      5            6    7
three       8      9           10   11
four       12     13           14   15

In [91]:
date=df1+df2

In [92]:
date

       punjab  sindh  bilochistan  kpk
one         0      2            4    6
two         8     10           12   14
three      16     18           20   22
four       24     26           28   30

In [94]:
len(date)

4

In [95]:
date.shape

(4, 4)

In [97]:
date.size

16

In [98]:
date.count()

punjab         4
sindh          4
bilochistan    4
kpk            4
dtype: int64

In [104]:
date.value_counts()

punjab  sindh  bilochistan  kpk
24      26     28           30     1
16      18     20           22     1
8       10     12           14     1
0       2      4            6      1
dtype: int64

In [109]:
dat=pd.Series([1,2,3,4])
dat

0    1
1    2
2    3
3    4
dtype: int64

In [112]:
dat.take([2,1,1])

2    3
1    2
1    2
dtype: int64

In [115]:
import numpy as np
a=np.array([2,4,6,8,np.nan])
a

array([ 2.,  4.,  6.,  8., nan])

In [116]:
a.mean()

nan

In [117]:
df=pd.Series(a)

In [118]:
df

0    2.0
1    4.0
2    6.0
3    8.0
4    NaN
dtype: float64

In [119]:
df.mean()

5.0

In [120]:
df.mean(skipna=False)

nan

In [122]:
c=pd.Series([2,4,5,7,np.nan],index=["a","b","c","d","e"])
c

a    2.0
b    4.0
c    5.0
d    7.0
e    NaN
dtype: float64

In [123]:
d=pd.Series([2,5,7,4,3],index=["d","f","a","b","a"])

In [124]:
d

d    2
f    5
a    7
b    4
a    3
dtype: int64

In [186]:
c+d

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
dtype: float64

In [126]:
d

d    2
f    5
a    7
b    4
a    3
dtype: int64

In [127]:
d>2

d    False
f     True
a     True
b     True
a     True
dtype: bool

In [128]:
d[d>2]

f    5
a    7
b    4
a    3
dtype: int64

In [131]:
d[(d>2) & (d<7)]

f    5
b    4
a    3
dtype: int64

In [138]:
(d>2).all()

False

In [143]:
not(d[d<2].any())

True

In [142]:
d[d>5].sum()

7

In [144]:
d[d<2].any()

False

In [145]:
(d[d>2]).count()

4

In [146]:
np.random.seed(45687)
a=pd.Series(np.random.randn(4))
b=pd.Series(np.random.randn(3))
d=pd.concat([a,b])

In [147]:
d

0   -1.464708
1    0.263459
2   -0.560324
3   -1.476600
0   -0.292241
1    0.817537
2    0.128371
dtype: float64

In [149]:
d.index=np.arange(0,len(d))

In [150]:
d

0   -1.464708
1    0.263459
2   -0.560324
3   -1.476600
4   -0.292241
5    0.817537
6    0.128371
dtype: float64

In [155]:
w=pd.Series([4,5,6],index=["1","2","3"])
r=pd.Series([4,5,6],index=[1,2,3])
print(w)
r

1    4
2    5
3    6
dtype: int64

1    4
2    5
3    6
dtype: int64

In [ ]:
w.index=w.index.values.astype(int)
w+r

In [165]:
r=d.copy()

In [166]:
r

0   -1.464708
1    0.263459
2   -0.560324
3   -1.476600
4   -0.292241
5    0.817537
6    0.128371
dtype: float64

In [172]:
r.reindex(np.arange(0,10),fill_value=0)

0   -1.464708
1    0.263459
2   -0.560324
3   -1.476600
4   -0.292241
5    0.817537
6    0.128371
7    0.000000
8    0.000000
9    0.000000
dtype: float64

In [179]:
d
d.reindex(np.arange(0,10),fill_value=np.mean([3,5,7,8,7,6]))

0   -1.464708
1    0.263459
2   -0.560324
3   -1.476600
4   -0.292241
5    0.817537
6    0.128371
7    6.000000
8    6.000000
9    6.000000
dtype: float64

In [181]:
s3=pd.Series(["blue","red","yellow"],index=[2,4,8])
s3.reindex(np.arange(0,10),method="ffill")

0       NaN
1       NaN
2      blue
3      blue
4       red
5       red
6       red
7       red
8    yellow
9    yellow
dtype: object

In [182]:
s3.reindex(np.arange(0,10),method="bfill")

0      blue
1      blue
2      blue
3       red
4       red
5    yellow
6    yellow
7    yellow
8    yellow
9       NaN
dtype: object

In [183]:
s3.reindex(np.arange(0,10),method="nearest")

0      blue
1      blue
2      blue
3       red
4       red
5       red
6    yellow
7    yellow
8    yellow
9    yellow
dtype: object

In [187]:
u=s3.reindex(np.arange(0,10),method="ffill")
u

0       NaN
1       NaN
2      blue
3      blue
4       red
5       red
6       red
7       red
8    yellow
9    yellow
dtype: object

In [188]:
pd.isnull(u) #u.isnull()

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [189]:
u.notnull()

0    False
1    False
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
dtype: bool

In [190]:
u.notnull().sum()

8

In [192]:
pd.isnull(u).sum()

2

In [10]:
import numpy as np
import pandas as pd

In [14]:
a=pd.DataFrame(np.arange(16).reshape(4,4),index=["a","b","c","d"],columns=["karachi","lahore","islamabad","quetta"])
print(a)
b=pd.DataFrame(np.arange(15).reshape(3,5),index=["a","b","c"],columns=["karachi","lahore","islamabad","quetta","kpk"])
b

   karachi  lahore  islamabad  quetta
a        0       1          2       3
b        4       5          6       7
c        8       9         10      11
d       12      13         14      15

   karachi  lahore  islamabad  quetta  kpk
a        0       1          2       3    4
b        5       6          7       8    9
c       10      11         12      13   14

In [15]:
a+b

   islamabad  karachi  kpk  lahore  quetta
a        4.0      0.0  NaN     2.0     6.0
b       13.0      9.0  NaN    11.0    15.0
c       22.0     18.0  NaN    20.0    24.0
d        NaN      NaN  NaN     NaN     NaN

In [16]:
c=a.add(b,fill_value=0)
c

   islamabad  karachi   kpk  lahore  quetta
a        4.0      0.0   4.0     2.0     6.0
b       13.0      9.0   9.0    11.0    15.0
c       22.0     18.0  14.0    20.0    24.0
d       14.0     12.0   NaN    13.0    15.0

In [18]:
d=c.drop("kpk",axis=1)

In [19]:
d

   islamabad  karachi  lahore  quetta
a        4.0      0.0     2.0     6.0
b       13.0      9.0    11.0    15.0
c       22.0     18.0    20.0    24.0
d       14.0     12.0    13.0    15.0

In [ ]:
c.drop("c",inplace=True)

In [30]:
c

   islamabad  karachi  kpk  lahore  quetta
a        4.0      0.0  4.0     2.0     6.0
b       13.0      9.0  9.0    11.0    15.0
d       14.0     12.0  NaN    13.0    15.0

In [38]:
del c["kpk"]

In [39]:
c

   islamabad  karachi  lahore  quetta
a        4.0      0.0     2.0     6.0
b       13.0      9.0    11.0    15.0
d       14.0     12.0    13.0    15.0

In [43]:
city=["karachi","lahore","quetta","islamabad","mari"]
c=c.reindex(columns=city)
c

   karachi  lahore  quetta  islamabad  mari
a      0.0     2.0     6.0        4.0   NaN
b      9.0    11.0    15.0       13.0   NaN
d     12.0    13.0    15.0       14.0   NaN

In [44]:
c["mari"]=np.array([100,432,5443])
c

   karachi  lahore  quetta  islamabad  mari
a      0.0     2.0     6.0        4.0   100
b      9.0    11.0    15.0       13.0   432
d     12.0    13.0    15.0       14.0  5443

In [34]:
import pandas as pd

In [35]:
sam=pd.read_csv("sample.csv")
print(sam)

     id    name  chemistry  physics  maths  stats
0  pi01   adeel         20       50     60     90
1  pi02   simra         52       90     32     65
2  pi03  sufyan         85        6      5      4
3  pi04   faraz         50       56     66     52

In [36]:
sam1=pd.read_csv("sample.csv",names=["s.no","sname","urdu","maths","ecno","isl"],skiprows=1)
print(sam1)

   s.no   sname  urdu  maths  ecno  isl
0  pi01   adeel    20     50    60   90
1  pi02   simra    52     90    32   65
2  pi03  sufyan    85      6     5    4
3  pi04   faraz    50     56    66   52

In [37]:
sam1=pd.read_csv("sample.csv",names=["s.no","sname","urdu","maths","ecno","isl"],header=None)
sam1

   s.no   sname       urdu    maths   ecno    isl
0    id    name  chemistry  physics  maths  stats
1  pi01   adeel         20       50     60     90
2  pi02   simra         52       90     32     65
3  pi03  sufyan         85        6      5      4
4  pi04   faraz         50       56     66     52

In [38]:
sam1=pd.read_csv("sample.csv",names=["s.no","sname","urdu","maths","ecno","isl"],index_col=["s.no","sname"],skiprows=1)

In [39]:
sam1

             urdu  maths  ecno  isl
s.no sname
pi01 adeel     20     50    60   90
pi02 simra     52     90    32   65
pi03 sufyan    85      6     5    4
pi04 faraz     50     56    66   52

In [41]:
data=pd.read_csv("sample1.csv")
data

  marks   a    b    c
0  chem  12  5.0  NaN
1   phy  55  NaN    9
2  urdu  85  6.0  foo

In [48]:
data=pd.read_csv("sample1.csv",na_values="NULL")
data

  marks   a    b    c
0  chem  12  5.0  NaN
1   phy  55  NaN    9
2  urdu  85  6.0  foo

In [52]:
sentinal={"c":["foo","nan"]}
pd.read_csv("sample1.csv",na_values=sentinal)

  marks   a    b    c
0  chem  12  5.0  NaN
1   phy  55  NaN  9.0
2  urdu  85  6.0  NaN

In [53]:
data1=pd.read_csv("sample1.csv",nrows=2)

In [54]:
data1

  marks   a    b    c
0  chem  12  5.0  NaN
1   phy  55  NaN  9.0

In [58]:
chunk=pd.read_csv("sample.csv",chunksize=2)
print(chunk)
print(type(chunk))
for chunky in chunk:
    print(chunky)

<pandas.io.parsers.TextFileReader object at 0x000001E234A8B0A0>
<class 'pandas.io.parsers.TextFileReader'>
     id   name  chemistry  physics  maths  stats
0  pi01  adeel         20       50     60     90
1  pi02  simra         52       90     32     65
     id    name  chemistry  physics  maths  stats
2  pi03  sufyan         85        6      5      4
3  pi04   faraz         50       56     66     52

In [70]:
chunk=pd.read_csv("sample.csv",chunksize=2)
print(chunk)
print(type(chunk))
alist=[]
for chunky in chunk:
    alist.append(chunky)
print(alist[1])

<pandas.io.parsers.TextFileReader object at 0x000001E234B60460>
<class 'pandas.io.parsers.TextFileReader'>
     id    name  chemistry  physics  maths  stats
2  pi03  sufyan         85        6      5      4
3  pi04   faraz         50       56     66     52

In [6]:
import pandas as pd
dataa=list(open("exmp.txt"))
print(dataa)
data=pd.read_table("exmp.txt")
data

['     A B C\n', 'ade 10 20 30\n', 'sim 50 20 33\n', 'suf 88 54 56\n', 'sai 55 45 62']

          A B C
0  ade 10 20 30
1  sim 50 20 33
2  suf 88 54 56
3  sai 55 45 62

In [7]:
data=pd.read_table("exmp.txt",sep="\s+")
data

      A   B   C
ade  10  20  30
sim  50  20  33
suf  88  54  56
sai  55  45  62

In [8]:
result=pd.read_table("exmp.txt",skiprows=[1,3],sep="\s+")

In [9]:
result

      A   B   C
sim  50  20  33
sai  55  45  62

In [10]:
save1=pd.read_csv("exmp2.csv",names=["date","feild"],skiprows=1,index_col=["date","feild"])

save1.to_csv("exmp2.csv")
save1

Empty DataFrame
Columns: []
Index: [(10, html), (12, java), (14, javascript), (16, CSS), (18, rectjs)]

In [11]:
import numpy as np
dates=pd.date_range("26/10/2020",periods=10)
store=pd.Series(np.arange(1,11),index=dates)
store.to_csv("pract.csv")

In [12]:
store

2020-10-26     1
2020-10-27     2
2020-10-28     3
2020-10-29     4
2020-10-30     5
2020-10-31     6
2020-11-01     7
2020-11-02     8
2020-11-03     9
2020-11-04    10
Freq: D, dtype: int32

In [13]:
test=pd.read_json("exmp3.json")
test

    a   b   c
0  25  65  85
1  51  55  75
2  58  45   5

In [14]:
import csv
d=open("sample.csv")
reader=csv.reader(d)
for line in reader:
    print(line)

['id', 'name', 'chemistry', 'physics', 'maths', 'stats']
['pi01', 'adeel', '20', '50', '60', '90']
['pi02', 'simra', '52', '90', '32', '65']
['pi03', 'sufyan', '85', '6', '5', '4']
['pi04', 'faraz', '50', '56', '66', '52']

In [15]:
len(test)

3

In [16]:
test.columns

Index(['a', 'b', 'c'], dtype='object')

In [19]:
test["a"].head(n=2)

0    25
1    51
Name: a, dtype: int64

In [20]:
test.shape

(3, 3)

In [21]:
type(test)

pandas.core.frame.DataFrame

In [23]:
datetime1=pd.to_datetime(test["c"])
datetime1

0   1970-01-01 00:00:00.000000085
1   1970-01-01 00:00:00.000000075
2   1970-01-01 00:00:00.000000005
Name: c, dtype: datetime64[ns]

In [24]:
type(datetime1)

pandas.core.series.Series

In [29]:
frame=pd.read_csv("sample1.csv")
frame.to_pickle("sample1.pickle")
pickley=pd.read_pickle("sample1.pickle")
pickley

  marks   a    b    c
0  chem  12  5.0  NaN
1   phy  55  NaN    9
2  urdu  85  6.0  foo

In [32]:
df=pd.DataFrame({"age":np.random.randn(25)})
df

         age
0   0.731298
1   0.898818
2   1.068245
3   0.186426
4   1.269419
5  -0.626480
6  -1.585549
7  -0.157371
8   1.447814
9   0.346030
10  1.220752
11 -0.312384
12 -0.040317
13 -0.957064
14  1.237540
15  0.503738
16 -0.669675
17 -0.710123
18 -0.981369
19  1.783743
20 -0.828068
21  0.940867
22  0.747413
23  0.318697
24 -0.493015

In [47]:
store=pd.HDFStore("mydate.h5")
store["obj1"]=df
store["obj1_col"]=df["age"]
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydate.h5

In [51]:
x=store.obj1
print(x)
print(x.head())
type(x)

         age
0   0.731298
1   0.898818
2   1.068245
3   0.186426
4   1.269419
5  -0.626480
6  -1.585549
7  -0.157371
8   1.447814
9   0.346030
10  1.220752
11 -0.312384
12 -0.040317
13 -0.957064
14  1.237540
15  0.503738
16 -0.669675
17 -0.710123
18 -0.981369
19  1.783743
20 -0.828068
21  0.940867
22  0.747413
23  0.318697
24 -0.493015
        age
0  0.731298
1  0.898818
2  1.068245
3  0.186426
4  1.269419

pandas.core.frame.DataFrame

In [49]:
store.put("obj2",df,format="table")
store.select("obj2",where=["index>=10 and index<=20"])

         age
10  1.220752
11 -0.312384
12 -0.040317
13 -0.957064
14  1.237540
15  0.503738
16 -0.669675
17 -0.710123
18 -0.981369
19  1.783743
20 -0.828068

In [52]:
#store.close()

In [66]:
df.to_hdf("mydate.h5","obj3",format="table")

In [67]:
#df=pd.read_hdf("mydate.h5","obj3",where=["index>10"])

In [ ]:
farme.to_excel("exmp5.xlsx")

In [1]:
import pandas as pd

In [2]:
from numpy import nan as na
missingvalue=pd.DataFrame([["adeel","simra","faraz","sufyan"],[65,64,na,na],[23,54,46,54],[32,45,na,76]],columns=["name","mark1","mark2","mark3"])
display(missingvalue)

    name  mark1  mark2   mark3
0  adeel  simra  faraz  sufyan
1     65     64    NaN     NaN
2     23     54     46      54
3     32     45    NaN      76

In [3]:
clear=missingvalue.dropna()
clear

    name  mark1  mark2   mark3
0  adeel  simra  faraz  sufyan
2     23     54     46      54

In [4]:
clear=missingvalue.dropna(how="all")
clear

    name  mark1  mark2   mark3
0  adeel  simra  faraz  sufyan
1     65     64    NaN     NaN
2     23     54     46      54
3     32     45    NaN      76

In [5]:
from numpy import nan as na
missingvalue=pd.DataFrame([["adeel","simra",na,"sufyan"],[65,64,na,na],[23,54,na,54],[32,45,na,76]],columns=["name","mark1","mark2","mark3"])
display(missingvalue)

    name  mark1  mark2   mark3
0  adeel  simra    NaN  sufyan
1     65     64    NaN     NaN
2     23     54    NaN      54
3     32     45    NaN      76

In [6]:
clear0=missingvalue.dropna(axis=1)
clear0

    name  mark1
0  adeel  simra
1     65     64
2     23     54
3     32     45

In [7]:
clear0=missingvalue.dropna(axis=1,how="all")
clear0

    name  mark1   mark3
0  adeel  simra  sufyan
1     65     64     NaN
2     23     54      54
3     32     45      76

In [8]:
import numpy as np
fillvalue=pd.DataFrame(np.random.randn(5,4),columns=list("abcd"))
display(fillvalue.abs())
fillvalue.iloc[1:3,1:-1]=na
fillvalue["d"][3]=na
fillvalue

          a         b         c         d
0  0.660772  0.034092  1.138722  0.719618
1  0.825131  1.976518  0.072026  0.492809
2  1.169904  1.773731  0.828018  0.460562
3  0.075536  0.420801  0.297906  0.011833
4  0.432194  1.769062  0.684706  0.697492

          a         b         c         d
0 -0.660772 -0.034092  1.138722  0.719618
1 -0.825131       NaN       NaN -0.492809
2  1.169904       NaN       NaN -0.460562
3  0.075536  0.420801 -0.297906       NaN
4  0.432194  1.769062  0.684706 -0.697492

In [9]:
fill=fillvalue.fillna(0.5)
fill

          a         b         c         d
0 -0.660772 -0.034092  1.138722  0.719618
1 -0.825131  0.500000  0.500000 -0.492809
2  1.169904  0.500000  0.500000 -0.460562
3  0.075536  0.420801 -0.297906  0.500000
4  0.432194  1.769062  0.684706 -0.697492

In [10]:
fill1=fillvalue.fillna({"b":0.56,"c":1})
fill1

          a         b         c         d
0 -0.660772 -0.034092  1.138722  0.719618
1 -0.825131  0.560000  1.000000 -0.492809
2  1.169904  0.560000  1.000000 -0.460562
3  0.075536  0.420801 -0.297906       NaN
4  0.432194  1.769062  0.684706 -0.697492

In [11]:
fill2=fillvalue.fillna(method="ffill",axis=1)
display(fill2)
fill2=fillvalue.fillna(method="ffill",axis=1,limit=1)
fill2

          a         b         c         d
0 -0.660772 -0.034092  1.138722  0.719618
1 -0.825131 -0.825131 -0.825131 -0.492809
2  1.169904  1.169904  1.169904 -0.460562
3  0.075536  0.420801 -0.297906 -0.297906
4  0.432194  1.769062  0.684706 -0.697492

          a         b         c         d
0 -0.660772 -0.034092  1.138722  0.719618
1 -0.825131 -0.825131       NaN -0.492809
2  1.169904  1.169904       NaN -0.460562
3  0.075536  0.420801 -0.297906 -0.297906
4  0.432194  1.769062  0.684706 -0.697492

In [12]:
dupli=pd.DataFrame({"k1":["one","two"]*3+["one"],"k2":[1,1,3,2,2,2,1]})
dupli

    k1  k2
0  one   1
1  two   1
2  one   3
3  two   2
4  one   2
5  two   2
6  one   1

In [13]:
dupli.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [14]:
drop=dupli.drop_duplicates()
drop

    k1  k2
0  one   1
1  two   1
2  one   3
3  two   2
4  one   2

In [15]:
dupli["k3"]=[1,2,3,2,1,2,1]
dupli

    k1  k2  k3
0  one   1   1
1  two   1   2
2  one   3   3
3  two   2   2
4  one   2   1
5  two   2   2
6  one   1   1

In [17]:
drop1=dupli.drop_duplicates()
drop1

    k1  k2  k3
0  one   1   1
1  two   1   2
2  one   3   3
3  two   2   2
4  one   2   1

In [18]:
drop1=dupli.drop_duplicates(["k1","k3"])
drop1

    k1  k2  k3
0  one   1   1
1  two   1   2
2  one   3   3

In [19]:
drop1.duplicated()

0    False
1    False
2    False
dtype: bool

In [20]:
dupli.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [34]:
rename=pd.DataFrame(np.arange(16).reshape(4,4),index=["new york","ohio","colorado","london"],columns=["one","two","three","four"])
rename

          one  two  three  four
new york    0    1      2     3
ohio        4    5      6     7
colorado    8    9     10    11
london     12   13     14    15

In [35]:
transform=lambda x: x[0:4].upper()
rename1=rename.index.map(transform)
display(rename1)

Index(['NEW ', 'OHIO', 'COLO', 'LOND'], dtype='object')

In [36]:
rename1

Index(['NEW ', 'OHIO', 'COLO', 'LOND'], dtype='object')

In [37]:
transform=lambda x: x[0:4].upper()
rename1=rename.columns.map(transform)
display(rename1)

Index(['ONE', 'TWO', 'THRE', 'FOUR'], dtype='object')

In [52]:
from numpy import nan as none
replace=pd.DataFrame(np.arange(12).reshape(3,4),index=[1,2,3],columns=["one","two","three","four"])
replace.loc[2:3,"two"]=none
replace

   one  two  three  four
1    0  1.0      2     3
2    4  NaN      6     7
3    8  NaN     10    11

In [55]:
replace1=replace.replace(none,99)
replace1

   one   two  three  four
1    0   1.0      2     3
2    4  99.0      6     7
3    8  99.0     10    11

In [56]:
replace1=replace.replace(6,100)
replace1

   one  two  three  four
1    0  1.0      2     3
2    4  NaN    100     7
3    8  NaN     10    11

In [58]:
replace1=replace.replace([none,4],[99,44])
replace1

   one   two  three  four
1    0   1.0      2     3
2   44  99.0      6     7
3    8  99.0     10    11

In [3]:
import pandas as pd
import numpy as np
sample=pd.DataFrame(np.arange(5*4).reshape(5,4))
sample

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [5]:
sample.shape

(5, 4)

In [13]:
sampler=np.random.permutation(4)
sampler

array([3, 1, 2, 0])

In [14]:
sample=sample[sampler]
sample

    3   1   2   0
0   3   1   2   0
1   7   5   6   4
2  11   9  10   8
3  15  13  14  12
4  19  17  18  16

In [15]:

sample.take(sampler)

    3   1   2   0
3  15  13  14  12
1   7   5   6   4
2  11   9  10   8
0   3   1   2   0

In [2]:
import pandas as pd 
import numpy as np
data=pd.Series(["simra","none","sufyan",np.nan,None])
data

0     simra
1      none
2    sufyan
3       NaN
4      None
dtype: object

In [3]:
data.isnull()

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [6]:
data[data.notnull()]

0     simra
1      none
2    sufyan
dtype: object

In [7]:
dat1=pd.Series([1.2,np.nan,4,np.nan,98])
dat1

0     1.2
1     NaN
2     4.0
3     NaN
4    98.0
dtype: float64

In [8]:
d=dat1.dropna()
d

0     1.2
2     4.0
4    98.0
dtype: float64

In [13]:
test=pd.DataFrame(np.arange(16).reshape(4,4))
test.iloc[1:3,1]=np.nan
test.iloc[3,0]=np.nan
test

     0     1   2   3
0  0.0   1.0   2   3
1  4.0   NaN   6   7
2  8.0   NaN  10  11
3  NaN  13.0  14  15

In [14]:
test.dropna()

     0    1  2  3
0  0.0  1.0  2  3

In [19]:
test.dropna(axis=1,thresh=3)

     0   2   3
0  0.0   2   3
1  4.0   6   7
2  8.0  10  11
3  NaN  14  15

In [20]:
test.fillna(0.4)

     0     1   2   3
0  0.0   1.0   2   3
1  4.0   0.4   6   7
2  8.0   0.4  10  11
3  0.4  13.0  14  15

In [21]:
test.fillna({0:0.5,1:10})

     0     1   2   3
0  0.0   1.0   2   3
1  4.0  10.0   6   7
2  8.0  10.0  10  11
3  0.5  13.0  14  15

In [31]:
eaty=pd.DataFrame({"food":["apple","orange","banana","kivi","mango"],"quantity":[20,12,52,41,6]})
print(eaty)
dic={"kivi":"55rs","banana":"45rs","apple":"100rs","orange":"200rs","mango":"75rs"}

     food  quantity
0   apple        20
1  orange        12
2  banana        52
3    kivi        41
4   mango         6

In [34]:

eaty["rupess"]=eaty["food"].map(dic)
eaty

     food  quantity rupess
0   apple        20  100rs
1  orange        12  200rs
2  banana        52   45rs
3    kivi        41   55rs
4   mango         6   75rs

In [40]:
#by lambda function

dic={"apple":"100rs","orange":"200rs","banana":"45rs","kivi":"55rs","mango":"75rs"}
eaty["rupess"]=eaty["food"].map(lambda x:dic[x.lower()])
eaty

     food  quantity rupess
0   apple        20  100rs
1  orange        12  200rs
2  banana        52   45rs
3    kivi        41   55rs
4   mango         6   75rs

In [3]:
#discretization and binning
import pandas as pd
age=[12,10,12,6,8,6,12,10,9,6,6,12]
bins=[4,6,8,10,12]
ct=pd.cut(age,bins)
ct

[(10, 12], (8, 10], (10, 12], (4, 6], (6, 8], ..., (8, 10], (8, 10], (4, 6], (4, 6], (10, 12]]
Length: 12
Categories (4, interval[int64]): [(4, 6] < (6, 8] < (8, 10] < (10, 12]]

In [5]:
#indicates intervals
ct.codes

array([3, 2, 3, 0, 1, 0, 3, 2, 2, 0, 0, 3], dtype=int8)

In [7]:
pd.value_counts(ct)

(10, 12]    4
(4, 6]      4
(8, 10]     3
(6, 8]      1
dtype: int64

In [1]:
import pandas as pd
marks=[34,45,50,66,76,86,99,100,78]
data=[30,60,70,80,100]
q=pd.cut(marks,data)
q

[(30, 60], (30, 60], (30, 60], (60, 70], (70, 80], (80, 100], (80, 100], (80, 100], (70, 80]]
Categories (4, interval[int64]): [(30, 60] < (60, 70] < (70, 80] < (80, 100]]

In [2]:
q.codes

array([0, 0, 0, 1, 2, 3, 3, 3, 2], dtype=int8)

In [3]:
pd.value_counts(q)

(80, 100]    3
(30, 60]     3
(70, 80]     2
(60, 70]     1
dtype: int64

In [11]:
cloth=pd.DataFrame({"catagory":["lawn blue","lawn mustard","cotton","cotton white","lawn 2 piece"],"prize":[1200,1500,2000,2200,1000]})
display(cloth)
dis={"lawn blue":100,"lawn mustard":100,"cotton":200,"cotton white":200,"lawn 2 piece":300}

       catagory  prize
0     lawn blue   1200
1  lawn mustard   1500
2        cotton   2000
3  cotton white   2200
4  lawn 2 piece   1000

In [13]:
cloth["discount"]=cloth["catagory"].map(dis)
cloth

       catagory  prize  discount
0     lawn blue   1200       100
1  lawn mustard   1500       100
2        cotton   2000       200
3  cotton white   2200       200
4  lawn 2 piece   1000       300

In [ ]:
discount={"lawn blue":150,"lawn mustard":100,"cotton":250,"cotton white":250,"lawn 2 piece":200}
cloth["discount"]=cloth["catagory"].map(lambda x:discount)
cloth

In [1]:
import numpy as np
import pandas as pd
datay=pd.Series(np.random.randn(10),index=[["a","a","a","b","b","c","c","c","d","d"],[1,2,3,3,2,1,3,2,1,1]])
datay

a  1   -0.326129
   2    0.164300
   3   -2.300178
b  3    0.726704
   2   -1.055939
c  1   -0.305256
   3   -0.543610
   2   -0.588079
d  1    1.630836
   1   -0.408480
dtype: float64

In [2]:
datay["a"]

1   -0.326129
2    0.164300
3   -2.300178
dtype: float64

In [3]:
datay[:,3]

a   -2.300178
b    0.726704
c   -0.543610
dtype: float64

In [4]:
datay.loc["b":"c"]

b  3    0.726704
   2   -1.055939
c  1   -0.305256
   3   -0.543610
   2   -0.588079
dtype: float64

In [10]:
data=pd.Series(np.random.randn(6),index=[["a","a","b","b","c","d"],[1,3,1,3,4,2]])
print(data)

df=data.unstack() 
df

a  1   -0.239266
   3   -1.231664
b  1   -0.557255
   3   -1.640308
c  4    1.035758
d  2   -0.793358
dtype: float64

          1         2         3         4
a -0.239266       NaN -1.231664       NaN
b -0.557255       NaN -1.640308       NaN
c       NaN       NaN       NaN  1.035758
d       NaN -0.793358       NaN       NaN

In [11]:
data.unstack().stack()

a  1   -0.239266
   3   -1.231664
b  1   -0.557255
   3   -1.640308
c  4    1.035758
d  2   -0.793358
dtype: float64

In [16]:
frame=pd.DataFrame(np.arange(12).reshape(4,3),index=[["a","a","b","b"],[1,2,1,2]],columns=[["ohio","ohio","colorado"],["green","red","green"]])
frame.index.names=["key1","key2"]
frame.columns.names=["state","color"]
display(frame)

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [19]:
frame["colorado"]

color      green
key1 key2
a    1         2
     2         5
b    1         8
     2        11

In [23]:
frame.swaplevel("key2","key1")

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [25]:
frame.swaplevel("key2","key1").sort_index(level=0)

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [29]:
frame.sort_index()

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [31]:
frame.sort_index(level="key2")

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [34]:
frame.sort_index(level=1,axis=1)

state     colorado  ohio
color        green green red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [38]:
frame.swaplevel(1,0,axis=1)

color     green  red    green
state      ohio ohio colorado
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

In [39]:
frame.sum(level="key2")

state  ohio     colorado
color green red    green
key2
1         6   8       10
2        12  14       16

In [40]:
frame.sum(level="key1")

state  ohio     colorado
color green red    green
key1
a         3   5        7
b        15  17       19

In [42]:
frame.sum(level="color",axis=1)

color      green  red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [44]:
gift=pd.DataFrame({"a":np.arange(7),"b":np.arange(7,0,-1),"c":[1,12,12,12,13,24,43],"d":[4,3,2,1,5,6,7]})
gift

   a  b   c  d
0  0  7   1  4
1  1  6  12  3
2  2  5  12  2
3  3  4  12  1
4  4  3  13  5
5  5  2  24  6
6  6  1  43  7

In [46]:
gift.set_index(["c","d"])

      a  b
c  d
1  4  0  7
12 3  1  6
   2  2  5
   1  3  4
13 5  4  3
24 6  5  2
43 7  6  1

In [47]:
gift.set_index(["c","d"],drop=False)

      a  b   c  d
c  d
1  4  0  7   1  4
12 3  1  6  12  3
   2  2  5  12  2
   1  3  4  12  1
13 5  4  3  13  5
24 6  5  2  24  6
43 7  6  1  43  7

In [48]:
gift.reset_index()

   index  a  b   c  d
0      0  0  7   1  4
1      1  1  6  12  3
2      2  2  5  12  2
3      3  3  4  12  1
4      4  4  3  13  5
5      5  5  2  24  6
6      6  6  1  43  7

In [2]:
import pandas as pd
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g']) 
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [3]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [15]:
import numpy as np
df1=pd.DataFrame({"key1":["a","a","b","b","a","c"],"data1":np.arange(1,7)})
df2=pd.DataFrame({"key1":["a","b"],"data2":[2,4]})
display(df1)
df2

  key1  data1
0    a      1
1    a      2
2    b      3
3    b      4
4    a      5
5    c      6

  key1  data2
0    a      2
1    b      4

In [17]:
pd.merge(df1,df2,on="key1")

  key1  data1  data2
0    a      1      2
1    a      2      2
2    a      5      2
3    b      3      4
4    b      4      4

In [18]:
pd.merge(df1,df2,on="key1",how="outer")

  key1  data1  data2
0    a      1    2.0
1    a      2    2.0
2    a      5    2.0
3    b      3    4.0
4    b      4    4.0
5    c      6    NaN

In [21]:
pf3=pd.DataFrame({"key1":["a","A","a","b","c"],"data":range(5)})
pf4=pd.DataFrame({"key2":["s","a","b"],"data1":range(3)})
display(pf3)
display(pf4)
pd.merge(pf3,pf4,left_on="key1",right_on="key2")

  key1  data
0    a     0
1    A     1
2    a     2
3    b     3
4    c     4

  key2  data1
0    s      0
1    a      1
2    b      2

  key1  data key2  data1
0    a     0    a      1
1    a     2    a      1
2    b     3    b      2

In [22]:
pd.merge(pf3,pf4,left_on="key1",right_on="key2",how="outer")

  key1  data key2  data1
0    a   0.0    a    1.0
1    a   2.0    a    1.0
2    A   1.0  NaN    NaN
3    b   3.0    b    2.0
4    c   4.0  NaN    NaN
5  NaN   NaN    s    0.0

In [24]:
pf1=pd.DataFrame({"key":["a","A","a","b","c"],"data":range(5)})
pf2=pd.DataFrame({"key":["s","a","b"],"data1":range(3)})
display(pf1)
display(pf2)
pd.merge(pf1,pf2,on="key",how="left") #left  Use all key combinations found in the left table

  key  data
0   a     0
1   A     1
2   a     2
3   b     3
4   c     4

  key  data1
0   s      0
1   a      1
2   b      2

  key  data  data1
0   a     0    1.0
1   A     1    NaN
2   a     2    1.0
3   b     3    2.0
4   c     4    NaN

In [6]:
import pandas as pd
table=pd.DataFrame({"key":["foo","bar","baz"],"A":[2,3,4],"B":[5,64,5],"C":[6,76,4],"data":["simra","sufyan","saima"]})
table

   key  A   B   C    data
0  foo  2   5   6   simra
1  bar  3  64  76  sufyan
2  baz  4   5   4   saima

In [7]:
pd.melt(table,["key"])

    key variable   value
0   foo        A       2
1   bar        A       3
2   baz        A       4
3   foo        B       5
4   bar        B      64
5   baz        B       5
6   foo        C       6
7   bar        C      76
8   baz        C       4
9   foo     data   simra
10  bar     data  sufyan
11  baz     data   saima

In [8]:
rf1=pd.DataFrame({"key1":["I","II","III"],"key2":["one","two","thre"],"val":[6,5,4]})
rf1

  key1  key2  val
0    I   one    6
1   II   two    5
2  III  thre    4

In [9]:
rf2=pd.DataFrame({"key1":["I","II","II","IV"],"key2":["one","two","two","for"],"val":[6,5,8,9]})
rf2

  key1 key2  val
0    I  one    6
1   II  two    5
2   II  two    8
3   IV  for    9

In [10]:
pd.merge(rf1,rf2,on="key1")

  key1 key2_x  val_x key2_y  val_y
0    I    one      6    one      6
1   II    two      5    two      5
2   II    two      5    two      8

In [11]:
pd.merge(rf1,rf2,on="key1",how="outer")

  key1 key2_x  val_x key2_y  val_y
0    I    one    6.0    one    6.0
1   II    two    5.0    two    5.0
2   II    two    5.0    two    8.0
3  III   thre    4.0    NaN    NaN
4   IV    NaN    NaN    for    9.0

In [12]:
pd.merge(rf1,rf2,on=["key1","key2"])

  key1 key2  val_x  val_y
0    I  one      6      6
1   II  two      5      5
2   II  two      5      8

In [13]:
pd.merge(rf1,rf2,on=["key1","key2"],how="outer")

  key1  key2  val_x  val_y
0    I   one    6.0    6.0
1   II   two    5.0    5.0
2   II   two    5.0    8.0
3  III  thre    4.0    NaN
4   IV   for    NaN    9.0

In [14]:
pd.merge(rf1,rf2,on=["key1","key2"],how="left")

  key1  key2  val_x  val_y
0    I   one      6    6.0
1   II   two      5    5.0
2   II   two      5    8.0
3  III  thre      4    NaN

In [16]:
rf3=pd.DataFrame({"grp":[32,4]},index=["I","II"])
rf3

    grp
I    32
II    4

In [20]:
pd.merge(rf1,rf3,left_on="key1",right_index=True)

  key1 key2  val  grp
0    I  one    6   32
1   II  two    5    4

In [21]:
pd.merge(rf1,rf3,left_on="key1",right_index=True,how="outer")

  key1  key2  val   grp
0    I   one    6  32.0
1   II   two    5   4.0
2  III  thre    4   NaN

In [27]:
rf4=pd.DataFrame({"grp":[3,9]})

rf4

   grp
0    3
1    9

In [29]:
pd.merge(rf1,rf4,left_index=True,right_index=True,how="outer")

  key1  key2  val  grp
0    I   one    6  3.0
1   II   two    5  9.0
2  III  thre    4  NaN

In [30]:
pd.merge(rf3,rf4,left_index=True,right_index=True,how="outer")

    grp_x  grp_y
I    32.0    NaN
II    4.0    NaN
0     NaN    3.0
1     NaN    9.0

In [31]:
pd.merge(rf1,rf4,left_index=True,right_index=True)

  key1 key2  val  grp
0    I  one    6    3
1   II  two    5    9